Revit 2024 API
PDFExportOptions.OriginOffsetX Property
 Offset between left sides of pdf content and paper. Always stored in unit of Feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public double OriginOffsetX { get; set; }
Visual Basic
Public Property OriginOffsetX As Double
	Get
	Set
Visual C++
public:
property double OriginOffsetX {
	double get ();
	void set (double value);
}
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace